In [6]:
import pandas as pd

- dataframe : table 
- series : column

In [3]:
#numpy와 비교
import numpy as np
data = np.array([1,2,3,4,5])
data

array([1, 2, 3, 4, 5])

In [4]:
data = pd.Series([1,2,3,4,5]) #S 대문자
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
data_2 = np.array([[1,2,3,4,5],[6,7,8,9,10]])
data_2

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [5]:
data_2 = pd.Series([[1,2,3,4,5],[6,7,8,9,10]]) #데이터 프래임을 구성하는 요소이며
data_2  #인덱스 데이터 타입 3개를 한번에 저장한다.(독립적으로 구분)

0     [1, 2, 3, 4, 5]
1    [6, 7, 8, 9, 10]
dtype: object

In [6]:
data_2 = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10]],columns=['a','b','c','d','e'],
                     index = ['one','two'])
data_2

     a  b  c  d   e
one  1  2  3  4   5
two  6  7  8  9  10

In [7]:
data_2['a'] #열 접근이 가능하다

one    1
two    6
Name: a, dtype: int64

In [8]:
data_2.loc['one'] #= iloc = ix /행은 loc명령어 통해서 접근한다

a    1
b    2
c    3
d    4
e    5
Name: one, dtype: int64

In [12]:
 data_2.iloc[0:2] #ilic은 순서로 접근한다.

     a  b  c  d   e
one  1  2  3  4   5
two  6  7  8  9  10

In [10]:
data_2.ix[0:1] #ix는 순서로 가능하다

C:\ProgramData\Anaconda3\envs\finance\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

     a  b  c  d  e
one  1  2  3  4  5

In [20]:
data_3 = pd.DataFrame([[1,2,3],[4,5,6]])
data_3 #인덱스를 만들지 않으면 숫자로 생성되며 문자로도 인정이 된다.

   0  1  2
0  1  2  3
1  4  5  6

In [21]:
data_3.iloc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [28]:
data_3.iloc[1]

0    4
1    5
2    6
Name: 1, dtype: int64

In [27]:
data_3.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [29]:
data_3.ix[0]

C:\ProgramData\Anaconda3\envs\finance\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    1
1    2
2    3
Name: 0, dtype: int64

In [36]:
data_3.iloc[:1] #인덱스 숫자로 접근하기 때문이다

   0  1  2
0  1  2  3

In [37]:
data_3.loc[:1] #loc은 숫자를 문자로 접근하기 때문이다.

   0  1  2
0  1  2  3
1  4  5  6

In [56]:
data = np.array([i for i in range(100)]).reshape(10,10)

data3 = pd.DataFrame(data)
data3

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [61]:
data3.loc[1:3]

    0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39

In [63]:
data3.ix[1:5]#loc으로 먼저 인식된다

C:\ProgramData\Anaconda3\envs\finance\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59

Quiz) 위의 data_3에서 데이터 '44'를 지정해보세요.

In [124]:
data3[5] # data3[5]는 colum의 indexing으로 간주
data3[3:5] #data3[3:5] 슬라이싱은 row로 간주한다. 슬라이싱 2개는 row,col로 인식된다.
data3[4].loc[4]
data3.loc[4,4]
data3[4][4]
data3.loc[4][4]
data3[5][4] # row다음 col식으로 검색

45

Quiz)위의 data_#에서 데이터 30~49까지를 지정해보세요.

In [93]:
data3[3:5][:]
data3.loc[3:4,:]
data3[:][3:5]
#data3[3:5][:]

    0   1   2   3   4   5   6   7   8   9
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

Quiz) 위의 data_#에서 데이터 "33,43"까지를 지정해보세요.

In [123]:
data3.loc[3:4,3:3]

    3
3  33
4  43

In [109]:
data3.iloc[3:5,3:4] #

    3
3  33
4  43

In [122]:
data3[3:5][3]

3    33
4    43
Name: 3, dtype: int32

In [136]:
data3.tail(4) #가로안에 안적으면 5로 간주

    0   1   2   3   4   5   6   7   8   9
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [133]:
data3.head(3)

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29

In [135]:
data3.shape

(10, 10)

In [137]:
data3.columns

RangeIndex(start=0, stop=10, step=1)

In [138]:
data3.columns.dtype

dtype('int64')

In [139]:
data3.index

RangeIndex(start=0, stop=10, step=1)

In [141]:
list(data3) #리스트로 형변환이 아닌 columns값을 추출

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

- column의 순서를 바꾸서 싶다면?   
풀이) list관점에서 생각하면 된다,

In [145]:
cols = list(data3)

cols.update(0,9)
cols

AttributeError: 'list' object has no attribute 'update'

In [144]:
cols.pop()

9

In [149]:
cols = list(data3)

cols.insert(0,cols.pop(9))

cols

[9, 0, 1, 2, 3, 4, 5, 6, 7, 8]

In [150]:
data3

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [152]:
data3[cols]

    9   0   1   2   3   4   5   6   7   8
0   9   0   1   2   3   4   5   6   7   8
1  19  10  11  12  13  14  15  16  17  18
2  29  20  21  22  23  24  25  26  27  28
3  39  30  31  32  33  34  35  36  37  38
4  49  40  41  42  43  44  45  46  47  48
5  59  50  51  52  53  54  55  56  57  58
6  69  60  61  62  63  64  65  66  67  68
7  79  70  71  72  73  74  75  76  77  78
8  89  80  81  82  83  84  85  86  87  88
9  99  90  91  92  93  94  95  96  97  98

In [156]:
cols[1] = 100
cols

[9, 100, 1, 2, 3, 4, 5, 6, 7, 2]

data3[cols]

In [159]:
data3[0] = data3[9]

In [160]:
data3

    0   1   2   3   4   5   6   7   8   9
0   9   1   2   3   4   5   6   7   8   9
1  19  11  12  13  14  15  16  17  18  19
2  29  21  22  23  24  25  26  27  28  29
3  39  31  32  33  34  35  36  37  38  39
4  49  41  42  43  44  45  46  47  48  49
5  59  51  52  53  54  55  56  57  58  59
6  69  61  62  63  64  65  66  67  68  69
7  79  71  72  73  74  75  76  77  78  79
8  89  81  82  83  84  85  86  87  88  89
9  99  91  92  93  94  95  96  97  98  99

In [167]:
#dictionary와 비교
dic = {'a':1,'b':2}
dic

#데이터 수정 : 'a' <-3

#데이터 추가 : 'c' <-5
dic['a']=3
dic['c']=5
dic

{'a': 3, 'b': 2, 'c': 5}

- DataFrame도 이와 같다.

In [170]:
df_1 = pd.DataFrame([[1,2,3],[4,5,6,]],columns=['a','b','c'])
df_1

   a  b  c
0  1  2  3
1  4  5  6

In [182]:
#데이터 수정 : 'a' <- 
#df_1['a']= 5
df_1['a']=[9,5]
#데이터 추가 : 'd'
df_1['d']=[1,2]
#df_1['d']=df_1['c']

In [183]:
df_1

   a  b  c  d
0  5  2  3  1
1  5  5  6  2

In [184]:
df_1['a']+=3
df_1

   a  b  c  d
0  8  2  3  1
1  8  5  6  2

In [185]:
df_1['a'] = df_1.b * df_1.c

In [186]:
df_1

    a  b  c  d
0   6  2  3  1
1  30  5  6  2

In [187]:
# columns 지정하는 또다른 방법
df_1.a

0     6
1    30
Name: a, dtype: int64

- 아래와 같이 숫자로 형변환이 안되는 경우

In [195]:
df_2 = pd.DataFrame([['1,000','2,000','3,000'],['1','2','3']])

In [196]:
df_2

       0      1      2
0  1,000  2,000  3,000
1      1      2      3

In [207]:
df_2=df_2.stack().str.replace(",",'').unstack()

In [203]:
df_2

      0     1     2
0  1000  2000  3000
1     1     2     3

In [205]:
df_2.astype(float)

        0       1       2
0  1000.0  2000.0  3000.0
1     1.0     2.0     3.0

In [206]:
df_2.astype(int)

      0     1     2
0  1000  2000  3000
1     1     2     3

In [209]:
multi_ind = pd.MultiIndex.from_tuples([('a',0),('a',1)])

multi_col = [['b','b','b'],[0,1,2]]

In [211]:
df_mul = pd.DataFrame(df_2,columns=multi_col,index=multi_ind)

In [212]:
df_mul

      b
      0   1   2
a 0 NaN NaN NaN
  1 NaN NaN NaN

In [3]:
import numpy as np

In [5]:
str_a1 = np.array(['1.567','0.123','8'])
str_a1.dtype

dtype('<U5')